/*****************************************************************************
File name: TDT_Task\src\dbus_task.h
Description: 遥控器数据解算任务
Author: 肖银河
Version: 1.1.1.191112_alpha
Date: 19.11.12
History: 
	——————————————————————————————————————————————————————————————————————————
	19.11.12 首次完成
	——————————————————————————————————————————————————————————————————————————
*****************************************************************************/
#ifndef __DBUS_TASK_H__
#define __DBUS_TASK_H__

#include "board.h"
#include "dbus.h"

extern uint8_t deforceFlag;//脱力标志位

#endif
