/*****************************************************************************
File name: TDT_Bsp\src\iwdg.cpp
Description: 看门狗控制
Author: 祖传
Version: 1.1.1.191112_alpha
Date: 19.11.12
History: 
	——————————————————————————————————————————————————————————————————————————
	19.11.12 首次完成
	——————————————————————————————————————————————————————————————————————————
*****************************************************************************/
#ifndef _IWDG_H
#define _IWDG_H

#include "board.h"

void iwdgInit(u8 prer,u16 rlr);//IWDG初始化
void iwdgFeed(void);  //喂狗函数

#endif
