/******************************
File name: TDT_Task\src\cycle.cpp
Description: 用于检测两次调用之间的时间
function:
	——————————————————————————————————————————————————————————————————————————
	float Get_Cycle_T(u8 item)	
	——————————————————————————————————————————————————————————————————————————
	void TDT_Cycle_Init(void)
	——————————————————————————————————————————————————————————————————————————
Author: 祖传
Version: 1.1.1.191112_alpha
Date: 19.11.12
History: 
	——————————————————————————————————————————————————————————————————————————
	19.11.21 肖银河-改写为类，并且保留原始函数
	——————————————————————————————————————————————————————————————————————————
	19.11.16 改写Get_Cycle_T函数，省略初始化后，第一次调用返回值为零，修改入参
	——————————————————————————————————————————————————————————————————————————
	19.11.12 首次记录
	——————————————————————————————————————————————————————————————————————————
****************************  */
#include "cycle.h"

#define NOW 0
#define OLD 1
#define NEW 2


/**
  * @brief 获取时间信息函数
  * @return 间隔的时间（周期）
  */
float Cycle::getCycleT()	
{
	cycleTime[OLD] = cycleTime[NOW];	//上一次的时间
	cycleTime[NOW] = getSysTimeUs()/1000000.0f; //本次的时间
	cycleTime[NEW] = (( cycleTime[NOW] - cycleTime[OLD] ) );//间隔的时间（周期）
	//第一次运行返回零
	if(cycleTime[OLD]==0)
	{
		return 0;
	}
	return cycleTime[NEW];
}

